Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_usart.c
/*********************************************************************************************************//**
 * @file    ht32f175x_275x_usart.c
 * @version V1.0
 * @date    11/26/2010
 * @brief   This file provides all the USART firmware functions.
 *************************************************************************************************************
 *
 * <h2><center>Copyright (C) 2011 Holtek Semiconductor Inc. All rights reserved</center></h2>
 *
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f175x_275x_usart.h"
#include "ht32f175x_275x_ckcu.h"
#include "ht32f175x_275x_rstcu.h"

/** @addtogroup HT32F175x_275x_Peripheral_Driver HT32F175x/275x Peripheral Driver
  * @{
  */

/** @defgroup  USART USART
  * @brief USART driver modules
  * @{
  */

/* Private typedef -----------------------------------------------------------------------------------------*/

/** @defgroup USART_Private_TypesDefinitions USART private types definitions
  * @{
  */

/**
  * @}
  */


/* Private define ------------------------------------------------------------------------------------------*/

/** @defgroup USART_Private_Define USART private defines
  * @{
  */
#define LCR_CLEAR_Mask            ((u32)0xFFFFFFE0)
#define MDR_CLEAR_Mask            ((u32)0xFFFFFFFC)
#define FCR_RFITL_CLEAR_Mask      ((u32)0xFFFFFF3F)
#define FCR_TFITL_CLEAR_Mask      ((u32)0xFFFFFFCF)
#define TRSM_CLEAR_Mask           ((u32)0xFFFFFFFB)
#define TPR_TG_Mask               ((u32)0xFFFF00FF)
#define RCR_ILPDVSR_Mask          ((u32)0xFFFF00FF)
#define TPR_RTOIC_Mask            ((u32)0xFFFFFF80)
#define DLR_BR_Mask               ((u32)0xFFFF0000)
#define RS485CR_ADDM_Mask         ((u32)0xFFFF00FF)

#define USART_IRDA_ON             ((u32)0x00000001)
#define USART_IRDA_OFF            ((u32)0xFFFFFFFE)

#define USART_BREAK_ON            ((u32)0x00000040)
#define USART_BREAK_OFF           ((u32)0xFFFFFFBF)

#define USART_TIMEOUT_ON          ((u32)0x00000080)
#define USART_TIMEOUT_OFF         ((u32)0xFFFFFF7F)

#define USART_SPE_ON              ((u32)0x00000020)
#define USART_SPE_OFF             ((u32)0xFFFFFFDF)

#define USART_TXEN_ON             ((u32)0x00000100)
#define USART_TXEN_OFF            ((u32)0xFFFFFEFF)

#define USART_RXEN_ON             ((u32)0x00000200)
#define USART_RXEN_OFF            ((u32)0xFFFFFDFF)

#define USART_TXINV_ON            ((u32)0x00000010)
#define USART_TXINV_OFF           ((u32)0xFFFFFFEF)

#define USART_RXINV_ON            ((u32)0x00000020)
#define USART_RXINV_OFF           ((u32)0xFFFFFFDF)

#define USART_HFCEN_ON            ((u32)0x00000004)
#define USART_HFCEN_OFF           ((u32)0xFFFFFFFB)

#define USART_TxPDMA_ON           ((u32)0x00000010)
#define USART_TxPDMA_OFF          ((u32)0xFFFFFFEF)

#define USART_RxPDMA_ON           ((u32)0x00000020)
#define USART_RxPDMA_OFF          ((u32)0xFFFFFFDF)

#define USART_RS485NMM_ON           ((u32)0x00000002)
#define USART_RS485NMM_OFF          ((u32)0xFFFFFFFD)

#define USART_RS485AAD_ON           ((u32)0x00000004)
#define USART_RS485AAD_OFF          ((u32)0xFFFFFFFB)
/**
  * @}
  */

/* Private macro -------------------------------------------------------------------------------------------*/

/** @defgroup USART_Private_Macro USART private macros
  * @{
  */

/**
  * @}
  */

/* Private variables ---------------------------------------------------------------------------------------*/

/** @defgroup USART_Private_Variable USART private variables
  * @{
  */

/**
  * @}
  */

/* Private function prototypes -----------------------------------------------------------------------------*/

/** @defgroup USART_Private_Function_Prototype USART private function prototypes
  * @{
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------------------------------------*/

/** @defgroup USART_Private_Function USART private functions
  * @{
  */

/*********************************************************************************************************//**
 * @brief Deinitialize registers of the USART peripheral by resetting USART.
 * @param USARTx: where USARTx is USART to select the USART peripheral, x can be 0 or 1.
 * @retval None
 ************************************************************************************************************/
void USART_DeInit(USART_TypeDef* USARTx)
{
  /* Check the parameters */
  Assert_Param(IS_USART(USARTx));

  if(USARTx == USART0)
  {
    RSTCU_APBPerip0Reset(RSTCU_APBRST0_USART0, ENABLE);
  }
  else
  {
    RSTCU_APBPerip0Reset(RSTCU_APBRST0_USART1, ENABLE);
  }
}

/*********************************************************************************************************//**
 * @brief Initialize the USARTx peripheral according to the specified parameters in the USART_InitStruct.
 * @param USARTx: where USARTx is USART to select the USART peripheral, x can be 0 or 1.
 * @param USART_InitStructure: pointer to a USART_InitTypeDef structure that contains the configuration information
 *        for the specified USART peripheral.
 * @retval None
 ************************************************************************************************************/
void USART_Init(USART_TypeDef* USARTx, USART_InitTypeDef* USART_InitStructure)
{
  u32 tmpreg = 0x00;
  CKCU_ClocksTypeDef Clocks;

  /* Check the parameters */
  Assert_Param(IS_USART(USARTx));
  Assert_Param(IS_USART_BAUDRATE(USART_InitStructure->USART_BaudRate));
  Assert_Param(IS_USART_WORD_LENGTH(USART_InitStructure->USART_WordLength));
  Assert_Param(IS_USART_STOPBITS(USART_InitStructure->USART_StopBits));
  Assert_Param(IS_USART_PARITY(USART_InitStructure->USART_Parity));
  Assert_Param(IS_USART_MODE(USART_InitStructure->USART_Mode));

  /*---------------------------- USART LCR Configuration ---------------------------------------------------*/
  tmpreg = USARTx->LCR & LCR_CLEAR_Mask;

  tmpreg |= USART_InitStructure->USART_StopBits | USART_InitStructure->USART_WordLength  |
            USART_InitStructure->USART_Parity;

  USARTx->LCR = tmpreg;

